import React from 'react';
import {Link} from 'react-router-dom';
import './Instruction.scss';

type Props = {
    setIsStarted: React.Dispatch<React.SetStateAction<boolean>>;
}

export const Instruction: React.FC<Props> = ({ setIsStarted }) => {
    return (
        <>
            <div className="content">
                <h1 className="content_title">Тест</h1>
                <h2 className="content_instruction">Інструкція</h2>
                <p className="content_main">
                    {'На виконання кожного тесту дається рівно 30 хв. Не затримуйтеся занадто довго над одним завданням. Можливо, ви перебуваєте на помилковому шляху, тоді краще перейти до наступного завдання. Але і не здавайтеся занадто легко; більшість завдань вирішується, якщо ви виявите трохи наполегливості. Продовжувати міркувати над завданням або відмовитися від спроб і перейти до наступного — підкаже здоровий глузд. Пам\'ятайте при цьому, що загалом, до кінця серії завдання стають складнішими. Кожна людина спроможна вирішити частину запропонованих завдань, але ніхто не в змозі справитися з усіма завданнями за півгодини.\n'}
                </p>
                <p className="content_main">
                    {'Відповіддю на завдання є одне число, буква або слово. Іноді потрібно зробити вибір з декількох можливостей, іноді ви самі повинні придумати відповідь. Відповідь напишіть у зазначеному місці. Якщо ви не можете розв\'язати завдання, то не варто навмання писати відповідь. Якщо ж у вас є ідея, але ви не впевнені в її правильності, то всеж-таки дайте відповідь. Тест не містить мудрованих завдань, але прийдеться розглядати кілька шляхів рішення. Перш ніж приступити до роботи, впевніться, що ви вірно все зрозуміли. Ви даремно втратите час, якщо візьметеся за розв\'язання, не усвідомивши, у чому полягає завдання.'}
                </p>

                <p className="content_note">Примітка:</p>
                <p className="content_note">Крапки означають кількість букв у пропущеному слові. Наприклад, (....) означає, що пропущене слово складається з чотирьох букв.</p>
            </div>

            <div className="button_wrapper">
                <Link to="/1">
                    <button
                        className="button_start"
                        onClick={() => setIsStarted(true)}
                    >
                        <p className="button_text">Розпочати</p>
                    </button>
                </Link>
            </div>

            <p className="warning">При натисканні на кнопку почнеться лічильник часу! </p>
        </>
    );
};
